devdnl/dnx-rtos/src/system/cpu/stm32h7/cpuctl.c
typedef struct {
        uint8_t  enable;                /*!< Specifies the status of the region.*/
        uint8_t  number;                /*!< Specifies the number of the region to protect.*/
        uint32_t base_address;          /*!< Specifies the base address of the region to protect.*/
        uint8_t  size;                  /*!< Specifies the size of the region to protect.*/
        uint8_t  sub_region_disable;    /*!< Specifies the number of the subregion protection to disable.*/
        uint8_t  type_ext_field;        /*!< Specifies the TEX field level.*/
        uint8_t  access_permission;     /*!< Specifies the region access permission type.*/
        uint8_t  disable_exec;          /*!< Specifies the instruction access status.*/
        uint8_t  is_shareable;          /*!< Specifies the shareability status of the protected region.*/
        uint8_t  is_cacheable;          /*!< Specifies the cacheable status of the region protected.*/
        uint8_t  is_bufferable;         /*!< Specifies the bufferable status of the protected region.*/
} MPU_region_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
void get_registers_from_stack(uint32_t *stack_address);

static void MPU_disable(void);
static void MPU_enable(uint32_t MPU_Control);
static void MPU_conf_region(MPU_region_t *mpu_region);
static uint8_t MPU_blk_to_region_size(uint32_t size);
static uint32_t MPU_region_size_to_blk(uint32_t size);

/*==============================================================================
  Local object definitions
==============================================================================*/
extern void *__heap_start;
extern void *__heap_size;
extern void *__ram1_start;
extern void *__ram1_size;
extern void *__ram2_start;
extern void *__ram2_size;
extern void *__ram3_start;
extern void *__ram3_size;
extern void *__ram4_start;
extern void *__ram4_size;
extern void *__dtcm_start;
extern void *__dtcm_size;

static _mm_region_t axisram;
static _mm_region_t sram1;
static _mm_region_t sram2;
static _mm_region_t sram3;
static _mm_region_t sram4;
static _mm_region_t dtcm;

static volatile reg_dump_t reg_dump __attribute__ ((section (".noinit")));

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief  Basic (first) CPU/microcontroller configuration. This function is
 *         called before system start.
 *
 * @param  None
 *
 * @return None
 */
//==============================================================================
void _cpuctl_init(void)
{
        NVIC_SetVectorTable(NVIC_VectTab_FLASH, __CPU_VTOR_TAB_POSITION__);
        NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

        /* enable FPU */
        SCB->CPACR |= ((3 << 20)|(3 << 22));

        #if __CPU_DISABLE_INTER_OF_MCYCLE_INSTR__ == _YES_
        /* disable interrupting multi-cycle instructions */
        SCnSCB->ACTLR |= SCnSCB_ACTLR_DISMCYCINT_Msk;
        #endif

        /* enable sleep on idle debug */
        SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEPD1);

        #if (__OS_MONITOR_CPU_LOAD__ > 0)
        _cpuctl_init_CPU_load_counter();
        #endif


        /*
         * NOTE:
         * SRAM1, SRAM2, SRAM3 and SRAM4 are generally used by drivers. In this
         * case MPU disables cache functionality in this regions.
         */
        MPU_disable();
        MPU_region_t mpu;
        mpu.enable = MPU_REGION_ENABLE;
        mpu.access_permission = MPU_REGION_FULL_ACCESS;
        mpu.disable_exec = MPU_INSTRUCTION_ACCESS_ENABLE;
        mpu.type_ext_field = MPU_TEX_LEVEL1;
        mpu.is_bufferable = MPU_ACCESS_NOT_BUFFERABLE;
        mpu.is_cacheable = MPU_ACCESS_NOT_CACHEABLE;
        mpu.is_shareable = MPU_ACCESS_SHAREABLE;
        mpu.sub_region_disable = 0;
        uint8_t mpu_region = 0;

        u32_t dma_cache = _MM_FLAG__DMA_CAPABLE | _MM_FLAG__CACHEABLE;

        _mm_register_region(&axisram, AXISRAM_HEAP_START, AXISRAM_HEAP_SIZE, dma_cache, "AXISRAM");

        if (DTCM_SIZE > 0) {
                _mm_register_region(&dtcm, DTCM_START, DTCM_SIZE, _MM_FLAG__DMA_CAPABLE, _CPUCTL_FAST_MEM);
        }

        if (SRAM1_SIZE > 0) {
                SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SRAM1EN);
                _mm_register_region(&sram1, SRAM1_START, SRAM1_SIZE, dma_cache, "SRAM1");

                mpu.base_address = (uint32_t)SRAM1_START;
                mpu.size = MPU_blk_to_region_size(SRAM1_SIZE);
                mpu.number = mpu_region++;
                MPU_conf_region(&mpu);
        }

        if (SRAM2_SIZE > 0) {
                SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SRAM2EN);
                _mm_register_region(&sram2, SRAM2_START, SRAM2_SIZE, dma_cache, "SRAM2");

                mpu.base_address = (uint32_t)SRAM2_START;
                mpu.size = MPU_blk_to_region_size(SRAM2_SIZE);
                mpu.number = mpu_region++;
                MPU_conf_region(&mpu);
        }

        if (SRAM3_SIZE > 0) {
                SET_BIT(RCC->AHB2ENR, RCC_AHB2ENR_SRAM3EN);
                _mm_register_region(&sram3, SRAM3_START, SRAM3_SIZE, dma_cache, "SRAM3");

                mpu.base_address = (uint32_t)SRAM3_START;
                mpu.size = MPU_blk_to_region_size(SRAM3_SIZE);
                mpu.number = mpu_region++;
                MPU_conf_region(&mpu);
        }

        if (SRAM4_SIZE > 0) {
                /*
                 * As shown in Figure 60, FLASH, AXISRAM, SRAM4, ITCM, DTCM1 and DTCM2 are
                 * implicitly allocated to the CPU. As a result, there is no enable bit allowing
                 * the CPU to allocate these memories.
                 */
                _mm_register_region(&sram4, SRAM4_START, SRAM4_SIZE, dma_cache, "SRAM4");

