devdnl/dnx-rtos/src/system/cpu/stm32h7/cpuctl.c
        _kernel_panic_report_from_ISR(_KERNEL_PANIC_DESC_CAUSE_SEGFAULT);
}


//==============================================================================
/**
 * @brief  Function clean/flush DCACHE.
 */
//==============================================================================
void _cpuctl_clean_dcache(void)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__
        SCB_CleanDCache();
#endif
}

//==============================================================================
/**
 * @brief  Function clean/flush and invalidate/reset DCACHE.
 */
//==============================================================================
void _cpuctl_clean_invalidate_dcache(void)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__
        SCB_CleanInvalidateDCache();
#endif
}

//==============================================================================
/**
 * @brief  Function invalidate/reset DCACHE.
 */
//==============================================================================
void _cpuctl_invalidate_dcache(void)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__
        SCB_InvalidateDCache();
#endif
}

//==============================================================================
/**
 * @brief  Function invalidate/reset DCACHE by address.
 *
 * @param  addr         address (must be aligned to 32 bytes)
 * @param  size         size in bytes
 */
//==============================================================================
void _cpuctl_invalidate_dcache_by_addr(void *addr, u32_t size)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__
        SCB_InvalidateDCache_by_Addr(addr, size);
#else
        (void)addr;
        (void)size;
#endif
}

//==============================================================================
/**
 * @brief  Function clean/flush DCACHE by address.
 *
 * @param  addr         address (must be aligned to 32 bytes)
 * @param  size         size in bytes
 */
//==============================================================================
void _cpuctl_clean_dcache_by_addr(void *addr, u32_t size)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__
        SCB_CleanDCache_by_Addr(addr, size);
#else
        (void)addr;
        (void)size;
#endif
}

//==============================================================================
/**
 * @brief  Function clean/flush and invalidate/reset DCACHE by address.
 *
 * @param  addr         address (must be aligned to 32 bytes)
 * @param  size         size in bytes
 */
//==============================================================================
void _cpuctl_clean_invalidate_dcache_by_addr(void *addr, u32_t size)
{
#if __DCACHE_PRESENT && __CPU_DCACHE_ENABLE__
        SCB_CleanInvalidateDCache_by_Addr(addr, size);
#else
        (void)addr;
        (void)size;
#endif
}

//==============================================================================
/**
 * @brief  Disables the MPU
 */
//==============================================================================
static void MPU_disable(void)
{
        /* Make sure outstanding transfers are done */
        __DMB();

        /* Disable fault exceptions */
        SCB->SHCSR &= ~SCB_SHCSR_MEMFAULTENA_Msk;

        /* Disable the MPU and clear the control register*/
        MPU->CTRL = 0;
}

//==============================================================================
/**
 * @brief  Enables the MPU
 * @param  MPU_Control Specifies the control mode of the MPU during hard fault,
 *         NMI, FAULTMASK and privileged access to the default memory
 *         This parameter can be one of the following values:
 *         @arg MPU_HFNMI_PRIVDEF_NONE
 *         @arg MPU_HARDFAULT_NMI
 *         @arg MPU_PRIVILEGED_DEFAULT
 *         @arg MPU_HFNMI_PRIVDEF
 * @retval None
 */
//==============================================================================
static void MPU_enable(uint32_t MPU_Control)
{
        /* Enable the MPU */
        MPU->CTRL = MPU_Control | MPU_CTRL_ENABLE_Msk;

        /* Enable fault exceptions */
        SCB->SHCSR |= SCB_SHCSR_MEMFAULTENA_Msk;

        /* Ensure MPU setting take effects */
        __DSB();
        __ISB();
}

//==============================================================================
/**
 * @brief  Initializes and configures the Region and the memory to be protected.
 * @param  MPU_Init Pointer to a MPU_Region_InitTypeDef structure that contains
 *                the initialization and configuration information.
 */
//==============================================================================
static void MPU_conf_region(MPU_region_t *mpu_region)
{
        MPU->RNR = mpu_region->number;

        if (mpu_region->enable) {
                MPU->RBAR = mpu_region->base_address;
                MPU->RASR = ((uint32_t)mpu_region->disable_exec << MPU_RASR_XN_Pos)
                          | ((uint32_t)mpu_region->access_permission << MPU_RASR_AP_Pos)
                          | ((uint32_t)mpu_region->type_ext_field << MPU_RASR_TEX_Pos)
                          | ((uint32_t)mpu_region->is_shareable << MPU_RASR_S_Pos)
                          | ((uint32_t)mpu_region->is_cacheable << MPU_RASR_C_Pos)
                          | ((uint32_t)mpu_region->is_bufferable << MPU_RASR_B_Pos)
                          | ((uint32_t)mpu_region->sub_region_disable << MPU_RASR_SRD_Pos)
                          | ((uint32_t)mpu_region->size << MPU_RASR_SIZE_Pos)
                          | ((uint32_t)mpu_region->enable << MPU_RASR_ENABLE_Pos);

                printk("CPU: DCACHE disabled for MPU region %u [%lXh-%lXh]",
                       mpu_region->number, mpu_region->base_address,
                       mpu_region->base_address + MPU_region_size_to_blk(mpu_region->size) - 1);
        } else {
                MPU->RBAR = 0x00;
                MPU->RASR = 0x00;
        }
}

//==============================================================================
/**
 * @brief  Convert block size to MPU block size.
 *
 * @param  size         block size
 *
 * @return MPU size. Return 0 if block is invalid.
 */
//==============================================================================
static uint8_t MPU_blk_to_region_size(uint32_t size)
{
        switch (size) {
        case 32UL: return MPU_REGION_SIZE_32B;
        case 64UL: return MPU_REGION_SIZE_64B;
        case 128UL: return MPU_REGION_SIZE_128B;
        case 256UL: return MPU_REGION_SIZE_256B;
        case 512UL: return MPU_REGION_SIZE_512B;
        case 1*1024UL: return MPU_REGION_SIZE_1KiB;
        case 2*1024UL: return MPU_REGION_SIZE_2KiB;
        case 4*1024UL: return MPU_REGION_SIZE_4KiB;
        case 8*1024UL: return MPU_REGION_SIZE_8KiB;
        case 16*1024UL: return MPU_REGION_SIZE_16KiB;
        case 32*1024UL: return MPU_REGION_SIZE_32KiB;
        case 64*1024UL: return MPU_REGION_SIZE_64KiB;
        case 128*1024UL: return MPU_REGION_SIZE_128KiB;
        case 256*1024UL: return MPU_REGION_SIZE_256KiB;
        case 512*1024UL: return MPU_REGION_SIZE_512KiB;
        case 1*1024*1024UL: return MPU_REGION_SIZE_1MiB;
        case 2*1024*1024UL: return MPU_REGION_SIZE_2MiB;
        case 4*1024*1024UL: return MPU_REGION_SIZE_4MiB;
        case 8*1024*1024UL: return MPU_REGION_SIZE_8MiB;
        case 16*1024*1024UL: return MPU_REGION_SIZE_16MiB;
        case 32*1024*1024UL: return MPU_REGION_SIZE_32MiB;
        case 64*1024*1024UL: return MPU_REGION_SIZE_64MiB;
        case 128*1024*1024UL: return MPU_REGION_SIZE_128MiB;
        case 256*1024*1024UL: return MPU_REGION_SIZE_256MiB;
        case 512*1024*1024UL: return MPU_REGION_SIZE_512MiB;
        case 1024*1024*1024UL: return MPU_REGION_SIZE_1GiB;
        case 2048*1024*1024UL: return MPU_REGION_SIZE_2GiB;
        case 4096*1024*1024UL: return MPU_REGION_SIZE_4GiB;
        default:
                printk("CPU: invalid MPU block size!");
                return 0;
        }
}

//==============================================================================
/**
 * @brief  Convert MPU size to block size.
 *
 * @param  size         MPU size
 *
 * @return Block size. Return 0 if block is invalid.
 */
//==============================================================================
static uint32_t MPU_region_size_to_blk(uint32_t size)
{
        return 1 << (size + 1);
}

/*==============================================================================
  End of file
==============================================================================*/
